#### Terraform Format 🖌 `success`
#### Terraform Validate 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
2025-10-15T06:44:07.447Z [INFO]  Terraform version: 1.12.1
2025-10-15T06:44:07.448Z [INFO]  Go runtime version: go1.24.2
2025-10-15T06:44:07.448Z [INFO]  CLI args: []string{"/opt/actions-runner/_work/_temp/8bb8fc51-2fa3-450f-b4d5-13dabc13db6f/terraform-bin", "plan", "-detailed-exitcode", "-no-color", "-var-file", "/opt/actions-runner/_work/oci-gitops-demoProject1/oci-gitops-demoProject1/azure/fra/compute/compute.json", "-var-file", "/opt/actions-runner/_work/oci-gitops-demoProject1/oci-gitops-demoProject1/azure/fra/database/database.json", "-var-file", "/opt/actions-runner/_work/oci-gitops-demoProject1/oci-gitops-demoProject1/azure/fra/project-network-security-groups.json", "-var-file", "/opt/actions-runner/_work/oci-gitops-demoProject1/oci-gitops-demoProject1/azure/fra/project-network.json", "-var-file", "/opt/actions-runner/_work/oci-gitops-demoProject1/oci-gitops-demoProject1/azure/fra/project-resource-groups.json", "-out=tfplan.binary"}
2025-10-15T06:44:07.449Z [INFO]  CLI command args: []string{"plan", "-detailed-exitcode", "-no-color", "-var-file", "/opt/actions-runner/_work/oci-gitops-demoProject1/oci-gitops-demoProject1/azure/fra/compute/compute.json", "-var-file", "/opt/actions-runner/_work/oci-gitops-demoProject1/oci-gitops-demoProject1/azure/fra/database/database.json", "-var-file", "/opt/actions-runner/_work/oci-gitops-demoProject1/oci-gitops-demoProject1/azure/fra/project-network-security-groups.json", "-var-file", "/opt/actions-runner/_work/oci-gitops-demoProject1/oci-gitops-demoProject1/azure/fra/project-network.json", "-var-file", "/opt/actions-runner/_work/oci-gitops-demoProject1/oci-gitops-demoProject1/azure/fra/project-resource-groups.json", "-out=tfplan.binary"}
2025-10-15T06:44:07.454Z [INFO]  backend-oracle_oci: Attempting to authenticate using instance principal credentials: operation=AuthConfigProvider req_id=c24597cd-0348-50e4-f9d8-78a6ed6aae3d
2025-10-15T06:44:08.154Z [INFO]  backend/local: starting Plan operation
2025-10-15T06:44:08.247Z [INFO]  backend-oracle_oci.azure-terraform.tfstate.lock: Locking remote state: operation=lock-state-file req_id=71d0d5aa-0764-3a91-c0cd-c79db26afd8a
2025-10-15T06:44:08.283Z [INFO]  backend-oracle_oci.azure-terraform.tfstate.lock: state lock response code: %+d
: operation=lock-state-file req_id=71d0d5aa-0764-3a91-c0cd-c79db26afd8a EXTRA_VALUE_AT_END=200
2025-10-15T06:44:08.283Z [INFO]  backend-oracle_oci.azure-terraform.tfstate: Downloading remote state: operation=download-state-file req_id=bd6d42f9-46c9-f7b0-0712-414f74c27050
2025-10-15T06:44:08.394Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:44:08.418Z [INFO]  provider.terraform-provider-azapi_v2.7.0: configuring server automatic mTLS: timestamp=2025-10-15T06:44:08.418Z
2025-10-15T06:44:08.465Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/azure/azapi/2.7.0/linux_arm64/terraform-provider-azapi_v2.7.0 id=419653
2025-10-15T06:44:08.465Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:44:08.477Z [INFO]  provider.terraform-provider-modtm_v0.3.5: configuring server automatic mTLS: timestamp=2025-10-15T06:44:08.476Z
2025-10-15T06:44:08.512Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/azure/modtm/0.3.5/linux_arm64/terraform-provider-modtm_v0.3.5 id=419661
2025-10-15T06:44:08.512Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:44:08.606Z [INFO]  provider.terraform-provider-azurerm_v4.48.0_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:44:08.606Z
2025-10-15T06:44:08.987Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/azurerm/4.48.0/linux_arm64/terraform-provider-azurerm_v4.48.0_x5 id=419668
2025-10-15T06:44:08.987Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:44:09.002Z [INFO]  provider.terraform-provider-null_v3.2.4_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:44:09.002Z
2025-10-15T06:44:09.038Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/null/3.2.4/linux_arm64/terraform-provider-null_v3.2.4_x5 id=419676
2025-10-15T06:44:09.038Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:44:09.049Z [INFO]  provider.terraform-provider-random_v3.7.2_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:44:09.049Z
2025-10-15T06:44:09.087Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/random/3.7.2/linux_arm64/terraform-provider-random_v3.7.2_x5 id=419683
2025-10-15T06:44:09.087Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:44:09.098Z [INFO]  provider.terraform-provider-tls_v4.1.0_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:44:09.098Z
2025-10-15T06:44:09.137Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/tls/4.1.0/linux_arm64/terraform-provider-tls_v4.1.0_x5 id=419690
2025-10-15T06:44:09.355Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:44:09.366Z [INFO]  provider.terraform-provider-modtm_v0.3.5: configuring server automatic mTLS: timestamp=2025-10-15T06:44:09.366Z
2025-10-15T06:44:09.398Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:44:09.497Z [INFO]  provider.terraform-provider-azurerm_v4.48.0_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:44:09.497Z
2025-10-15T06:44:09.530Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:44:09.544Z [INFO]  provider.terraform-provider-azapi_v2.7.0: configuring server automatic mTLS: timestamp=2025-10-15T06:44:09.544Z
2025-10-15T06:44:09.577Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:44:09.592Z [INFO]  provider.terraform-provider-random_v3.7.2_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:44:09.591Z
2025-10-15T06:44:09.624Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:44:09.638Z [INFO]  provider.terraform-provider-tls_v4.1.0_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:44:09.638Z
2025-10-15T06:44:10.098Z [INFO]  provider.terraform-provider-azapi_v2.7.0: [INFO] prepare validation for resource type: Microsoft.Network/virtualNetworks, api-version: 2023-11-01
2025-10-15T06:44:10.220Z [INFO]  provider.terraform-provider-azapi_v2.7.0: [INFO] prepare validation for resource type: Microsoft.Network/virtualNetworks/subnets, api-version: 2023-11-01
2025-10-15T06:44:10.332Z [INFO]  provider.terraform-provider-azapi_v2.7.0: [INFO] prepare validation for resource type: Microsoft.Network/virtualNetworks/virtualNetworkPeerings, api-version: 2023-11-01
2025-10-15T06:44:10.332Z [INFO]  provider.terraform-provider-azapi_v2.7.0: [INFO] prepare validation for resource type: Microsoft.Network/virtualNetworks/virtualNetworkPeerings, api-version: 2023-11-01
2025-10-15T06:44:10.334Z [INFO]  provider.terraform-provider-azapi_v2.7.0: [INFO] prepare validation for resource type: Microsoft.Network/virtualNetworks/virtualNetworkPeerings, api-version: 2023-11-01
2025-10-15T06:44:10.343Z [INFO]  provider.terraform-provider-azapi_v2.7.0: [INFO] prepare validation for resource type: Microsoft.Network/virtualNetworks/virtualNetworkPeerings, api-version: 2023-11-01
2025-10-15T06:44:10.347Z [INFO]  provider.terraform-provider-azapi_v2.7.0: [INFO] prepare validation for resource type: Microsoft.Network/virtualNetworks/virtualNetworkPeerings, api-version: 2023-11-01
2025-10-15T06:44:10.350Z [INFO]  provider.terraform-provider-azapi_v2.7.0: [INFO] prepare validation for resource type: Microsoft.Network/virtualNetworks/virtualNetworkPeerings, api-version: 2023-11-01
2025-10-15T06:44:10.368Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/azure/modtm/0.3.5/linux_arm64/terraform-provider-modtm_v0.3.5 id=419697
2025-10-15T06:44:10.382Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/random/3.7.2/linux_arm64/terraform-provider-random_v3.7.2_x5 id=419717
2025-10-15T06:44:10.385Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/tls/4.1.0/linux_arm64/terraform-provider-tls_v4.1.0_x5 id=419724
2025-10-15T06:44:10.443Z [INFO]  provider.terraform-provider-azapi_v2.7.0: [INFO] prepare validation for resource type: Microsoft.RecoveryServices/vaults/backupFabrics/protectionContainers/protectedItems, api-version: 2024-10-01
2025-10-15T06:44:10.452Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/azure/azapi/2.7.0/linux_arm64/terraform-provider-azapi_v2.7.0 id=419711
2025-10-15T06:44:10.483Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/azurerm/4.48.0/linux_arm64/terraform-provider-azurerm_v4.48.0_x5 id=419704
2025-10-15T06:44:10.483Z [INFO]  backend/local: plan calling Plan
2025-10-15T06:44:10.734Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:44:10.745Z [INFO]  provider.terraform-provider-modtm_v0.3.5: configuring server automatic mTLS: timestamp=2025-10-15T06:44:10.745Z
2025-10-15T06:44:10.778Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:44:10.789Z [INFO]  provider.terraform-provider-random_v3.7.2_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:44:10.789Z
2025-10-15T06:44:10.820Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:44:10.832Z [INFO]  provider.terraform-provider-azapi_v2.7.0: configuring server automatic mTLS: timestamp=2025-10-15T06:44:10.832Z
2025-10-15T06:44:10.865Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:44:10.876Z [INFO]  provider.terraform-provider-tls_v4.1.0_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:44:10.876Z
2025-10-15T06:44:10.908Z [INFO]  provider: configuring client automatic mTLS
2025-10-15T06:44:11.007Z [INFO]  provider.terraform-provider-azurerm_v4.48.0_x5: configuring server automatic mTLS: timestamp=2025-10-15T06:44:11.006Z
data.azurerm_subnet.existing["vnet-demo.subnet-public"]: Reading...
data.azurerm_network_security_group.existing["nsg-web"]: Reading...
data.azurerm_virtual_network.existing["vnet-demo"]: Reading...
data.azurerm_resource_group.existing["rg-demo"]: Reading...
data.azurerm_resource_group.existing["rg-demo"]: Read complete after 0s [id=/subscriptions/***/resourceGroups/rg-free-demo]
module.vm["vm-web"].data.modtm_module_source.telemetry[0]: Reading...
module.vm["vm-web"].data.azurerm_client_config.telemetry[0]: Reading...
module.vm["vm-web"].data.modtm_module_source.telemetry[0]: Read complete after 0s
module.vm["vm-web"].data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04NGI4NGM0MS1jZDkxLTRlNjktYmZkNC0xZmI0ZGY5YmEzYjE7b2JqZWN0SWQ9ZDgzYzhhZjktM2MwYS00ZDg0LTk3OTktZmI1N2JhNWQwNzBiO3N1YnNjcmlwdGlvbklkPWZiMDA2YTk1LTZlMDEtNDg1Mi04YWRjLWMwOTRkYjRkYTA4ZDt0ZW5hbnRJZD1mZDhhOTZiYy04NWFjLTRmNzUtOGUxMS02NjEzYjFhYTRmZDM=]
2025-10-15T06:44:16.403Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/random/3.7.2/linux_arm64/terraform-provider-random_v3.7.2_x5 id=419739
2025-10-15T06:44:16.410Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/azure/modtm/0.3.5/linux_arm64/terraform-provider-modtm_v0.3.5 id=419732
2025-10-15T06:44:16.412Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/tls/4.1.0/linux_arm64/terraform-provider-tls_v4.1.0_x5 id=419753
data.azurerm_virtual_network.existing["vnet-demo"]: Read complete after 1s [id=/subscriptions/***/resourceGroups/rg-free-demo/providers/Microsoft.Network/virtualNetworks/vnet-free-demo]
data.azurerm_network_security_group.existing["nsg-web"]: Read complete after 1s [id=/subscriptions/***/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkSecurityGroups/nsg-web]
data.azurerm_subnet.existing["vnet-demo.subnet-public"]: Read complete after 1s [id=/subscriptions/***/resourceGroups/rg-free-demo/providers/Microsoft.Network/virtualNetworks/vnet-free-demo/subnets/subnet-public]
2025-10-15T06:44:16.752Z [WARN]  Provider "registry.terraform.io/hashicorp/azurerm" produced an invalid plan for module.vm["vm-web"].azurerm_linux_virtual_machine.this[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .network_interface_ids: planned value cty.UnknownVal(cty.List(cty.String)) does not match config value cty.ListVal([]cty.Value{cty.UnknownVal(cty.String)})
      - .platform_fault_domain: planned value cty.NumberIntVal(-1) for a non-computed attribute
      - .termination_notification: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2025-10-15T06:44:16.762Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/azure/azapi/2.7.0/linux_arm64/terraform-provider-azapi_v2.7.0 id=419746
2025-10-15T06:44:16.774Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/azurerm/4.48.0/linux_arm64/terraform-provider-azurerm_v4.48.0_x5 id=419760
2025-10-15T06:44:16.995Z [INFO]  backend/local: plan operation completed
2025-10-15T06:44:16.995Z [INFO]  backend/local: writing plan output to: tfplan.binary

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vm["vm-web"].azurerm_linux_virtual_machine.this[0] will be created
  + resource "azurerm_linux_virtual_machine" "this" {
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = "vm-web-dgc00"
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + encryption_at_host_enabled                             = false
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "vm-web-dgc00"
      + network_interface_ids                                  = (known after apply)
      + os_managed_disk_id                                     = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = (known after apply)
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-free-demo"
      + size                                                   = "Standard_B1s"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + admin_ssh_key {
          + public_key = <<-EOT
                ssh-rsa ***REDACTED*** opc@vm-fra-runner1
            EOT
          + username   = "azureuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 30
          + id                        = (known after apply)
          + name                      = "vm-web-dgc00-osdisk"
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-focal"
          + publisher = "Canonical"
          + sku       = "20_04-lts-gen2"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.vm["vm-web"].azurerm_network_interface.virtualmachine_network_interfaces["nic"] will be created
  + resource "azurerm_network_interface" "virtualmachine_network_interfaces" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "eastus"
      + mac_address                    = (known after apply)
      + name                           = "vm-web-dgc00-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "rg-free-demo"
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = true
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = "/subscriptions/***/resourceGroups/rg-free-demo/providers/Microsoft.Network/virtualNetworks/vnet-free-demo/subnets/subnet-public"
        }
    }

  # module.vm["vm-web"].azurerm_network_interface_security_group_association.this["nic-nsg_association"] will be created
  + resource "azurerm_network_interface_security_group_association" "this" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = "/subscriptions/***/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkSecurityGroups/nsg-web"
    }

  # module.vm["vm-web"].azurerm_public_ip.virtualmachine_public_ips["nic-ipconfig1"] will be created
  + resource "azurerm_public_ip" "virtualmachine_public_ips" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 30
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "vm-web-dgc00-publicip"
      + resource_group_name     = "rg-free-demo"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.vm["vm-web"].modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-res-compute-virtualmachine/azurerm"
          + "module_version"  = "0.19.0"
          + "random_id"       = (known after apply)
          + "subscription_id" = "***"
          + "tenant_id" = "***"
        }
    }

  # module.vm["vm-web"].random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.vm["vm-web"].tls_private_key.this[0] will be created
  + resource "tls_private_key" "this" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ deployment_summary = {
      ~ virtual_machines = {
          ~ total = 0 -> 1
        }
        # (4 unchanged attributes hidden)
    }
  ~ resource_ids       = {
      ~ virtual_machines = {
          + vm-web = (known after apply)
        }
        # (4 unchanged attributes hidden)
    }
  ~ virtual_machines   = {
      + vm-web = {
          + id           = (known after apply)
          + name         = "vm-web-dgc00"
          + ssh_command  = "ssh -i ~/.ssh/azure_vm_key.pub azureuser@<VM_PUBLIC_IP>"
          + ssh_key_path = "~/.ssh/azure_vm_key.pub"
          + ssh_username = "azureuser"
        }
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"
2025-10-15T06:44:17.036Z [INFO]  backend-oracle_oci.azure-terraform.tfstate.lock: unlocking remote state: operation=unlock-state-file req_id=c8911836-22bd-d2fc-51d7-ad62f75b60ed
2025-10-15T06:44:17.065Z [INFO]  backend-oracle_oci.azure-terraform.tfstate.lock: Unlock response: %v
: operation=unlock-state-file req_id=c8911836-22bd-d2fc-51d7-ad62f75b60ed EXTRA_VALUE_AT_END=204
```

</details>

*Pushed by: @iblake*